
Функция ПолучитьРеквизитОбъекта(Знач Ссылка, Знач ИмяРеквизита) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("Массив") Тогда
		
		Если Ссылка.Количество() = 0 Тогда
			Возврат Новый Соответствие;
		КонецЕсли;
		
		Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Ссылка, ИмяРеквизита);
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
		
	КонецЕсли;
	
КонецФункции