
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПредварительнаяЗапись") Тогда
		
		Контрагент        = ДанныеЗаполнения.Клиент;
		Организация       = ДанныеЗаполнения.Организация;
		Сотрудник         = ДанныеЗаполнения.Сотрудник;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СуммаДокумента    = ДанныеЗаполнения.СуммаДокумента;
		
		Комментарий = СтрШаблон(
		"Введен на основании: Предварительная запись №%1 от %2",
		ДанныеЗаполнения.Номер,
		Формат(ДанныеЗаполнения.Дата, "ДФ=dd.MM.yyyy"));
		
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока            = Услуги.Добавить();
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Сумма      = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.Услуга     = ТекСтрокаУслуги.Услуга;
			НоваяСтрока.Цена       = ТекСтрокаУслуги.Цена;
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Сброс и установка флагов записи движений
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Продажи.Записывать         = Истина;
	Движения.УчетЗатрат.Записывать      = Истина;
	Движения.ЗаказыКлиентов.Записывать  = Истина;
	Движения.Хозрасчетный.Записывать    = Истина;
	
	// Блокировка данных
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	Блокировка.Заблокировать();
	
	// Запрос данных
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТовары.Номенклатура КАК Номенклатура,
	|	ИСТИНА КАК ЭтоТовар,
	|	СУММА(РеализацияТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТовары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Состав
	|ИЗ
	|	Документ.Реализация.Товары КАК РеализацияТовары
	|ГДЕ
	|	РеализацияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.Услуга,
	|	ЛОЖЬ,
	|	СУММА(РеализацияУслуги.Количество),
	|	СУММА(РеализацияУслуги.Сумма)
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияУслуги.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Состав.Номенклатура КАК Номенклатура,
	|	ВТ_Состав.ЭтоТовар КАК ЭтоТовар,
	|	ВТ_Состав.Количество КАК Количество,
	|	ВТ_Состав.Сумма КАК Сумма,
	|	ВТ_Состав.Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_Состав.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ВТ_Состав.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	ВТ_Состав КАК ВТ_Состав
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МоментВремени,
	|				Организация = &Организация
	|					И Склад = &Склад
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТ_Состав.Номенклатура
	|						ИЗ
	|							ВТ_Состав КАК ВТ_Состав
	|						ГДЕ
	|							ВТ_Состав.ЭтоТовар)) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_Состав.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	// 5. Формирование движений
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		
		// 4. Проверка остатков
		Если Выборка.ЭтоТовар Тогда
			Нехватка = Выборка.Количество - Выборка.КоличествоОстаток;
			Если Нехватка > 0 Тогда
				ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Недостаточно товара ""%1"" на складе. Не хватает: %2'"),
				Выборка.НоменклатураПредставление,
				Нехватка
				);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Отказ = Истина;
			КонецЕсли;
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			// Расчет себестоимости по средней
			Если Выборка.Количество = Выборка.КоличествоОстаток Тогда
				СуммаСписания = Выборка.СуммаОстаток;
			Иначе
				СуммаСписания = Выборка.Количество * Выборка.СуммаОстаток / Выборка.КоличествоОстаток;
			КонецЕсли;
			
			// Регистр Товары на складах
			ДвижениеТовары = Движения.ТоварыНаСкладах.Добавить();
			ДвижениеТовары.ВидДвижения  = ВидДвиженияНакопления.Расход;
			ДвижениеТовары.Период       = Дата;
			ДвижениеТовары.Организация  = Организация;
			ДвижениеТовары.Склад        = Склад;
			ДвижениеТовары.Номенклатура = Выборка.Номенклатура;
			ДвижениеТовары.Количество   = Выборка.Количество;
			ДвижениеТовары.Сумма        = СуммаСписания;
			
			// Регистр Учет затрат
			ДвижениеЗатраты = Движения.УчетЗатрат.Добавить();
			ДвижениеЗатраты.Период       = Дата;
			ДвижениеЗатраты.Организация  = Организация;
			ДвижениеЗатраты.СтатьяЗатрат = Выборка.СтатьяЗатрат;
			ДвижениеЗатраты.Сумма        = СуммаСписания;
			
			//Проводка по списанию товаров и материалов Дт90 Кт10/41
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.СчетДт     = ПланыСчетов.Хозрасчетный.Продажи;
			Движение.СчетКт     = Выборка.СчетБухгалтерскогоУчета;
			Движение.Период     = Дата;
			Движение.Сумма      = СуммаСписания;
			Движение.Содержание = "Списана себестоимость товарно-материальных ценностей";
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = Выборка.Номенклатура;
			
		КонецЕсли;
		
		// Регистр Продажи
		ДвижениеПродажи = Движения.Продажи.Добавить();
		ДвижениеПродажи.Период       = Дата;
		ДвижениеПродажи.Организация  = Организация;
		ДвижениеПродажи.Номенклатура = Выборка.Номенклатура;
		ДвижениеПродажи.Контрагент   = Контрагент;
		ДвижениеПродажи.Сотрудник    = Сотрудник;
		ДвижениеПродажи.Количество   = Выборка.Количество;
		ДвижениеПродажи.Сумма        = Выборка.Сумма;
		
	КонецЦикла;
	
	//Проводка по отражению выручки Дт62 Кт90
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетДт     = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.СчетКт     = ПланыСчетов.Хозрасчетный.Продажи;
	Движение.Период     = Дата;
	Движение.Сумма      = СуммаДокумента;
	Движение.Содержание = "Отражена выручка от реализации товаров и услуг";
	БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Контрагент);
	
	// Регистр Заказы клиентов
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ДвижениеЗаказ = Движения.ЗаказыКлиентов.Добавить();
		ДвижениеЗаказ.ВидДвижения  = ВидДвиженияНакопления.Расход;
		ДвижениеЗаказ.Период       = Дата;
		ДвижениеЗаказ.Организация  = Организация;
		ДвижениеЗаказ.Клиент       = Контрагент;
		ДвижениеЗаказ.ЗаказКлиента = ДокументОснование;
		ДвижениеЗаказ.Сумма        = Услуги.Итог("Сумма");
	КонецЕсли;
	
КонецПроцедуры
