
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.УчетЗатрат.Записывать      = Истина;
	Движения.Хозрасчетный.Записывать    = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	""Товары"" КАК ТипНоменклатуры,
	|	ПоступлениеТоваровИУслугТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ПоступлениеТоваровИУслугТовары.Количество) КАК Количество,
	|	СУММА(ПоступлениеТоваровИУслугТовары.Сумма) КАК Сумма,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяЗатрат,
	|	ПоступлениеТоваровИУслугТовары.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваровИУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровИУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровИУслугТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	СУММА(ПоступлениеТоваровИУслугУслуги.Сумма),
	|	ПоступлениеТоваровИУслугУслуги.СтатьяЗатрат,
	|	ПоступлениеТоваровИУслугУслуги.Услуга.СчетБухгалтерскогоУчета
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Услуги КАК ПоступлениеТоваровИУслугУслуги
	|ГДЕ
	|	ПоступлениеТоваровИУслугУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровИУслугУслуги.СтатьяЗатрат,
	|	ПоступлениеТоваровИУслугУслуги.Услуга.СчетБухгалтерскогоУчета";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипНоменклатуры      = "Товары" Тогда
			// регистр ТоварыНаСкладах
			Движение = Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
			Движение.Период       = Дата;
			Движение.Организация  = Организация;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Склад        = Склад;
			Движение.Количество   = Выборка.Количество;
			Движение.Сумма        = Выборка.Сумма;
		ИначеЕсли Выборка.ТипНоменклатуры = "Услуги" Тогда
			// регистр УчетЗатрат
			Движение = Движения.УчетЗатрат.Добавить();
			Движение.Период       = Дата;
			Движение.Организация  = Организация;
			Движение.СтатьяЗатрат = Выборка.СтатьяЗатрат;
			Движение.Сумма        = Выборка.Сумма;
		КонецЕсли;
		
		// регистр Хозрасчетный
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.СчетДт = Выборка.СчетБухгалтерскогоУчета;
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
		Движение.Период = Дата;
		Движение.Сумма  = Выборка.Сумма;
		Если Выборка.ТипНоменклатуры      = "Товары" Тогда
			Движение.Содержание = "Отражено поступление товарно-материальных ценностей от поставщика";
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Выборка.Номенклатура);
		ИначеЕсли Выборка.ТипНоменклатуры = "Услуги" Тогда
			Движение.Содержание = "Отражено поступление услуг от поставщика";
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Выборка.СтатьяЗатрат);
		КонецЕсли;
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, Контрагент);
		
	КонецЦикла;
	
КонецПроцедуры
