
Процедура ПередЗаписью(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		
		ЭтоЮрЛицо = (ТипОрганизации = Перечисления.ТипыОрганизаций.ЮридическоеЛицо);
		ТребуемаяДлина = ?(ЭтоЮрЛицо, 10, 12);
		
		Если СтрДлина(ИНН) <> ТребуемаяДлина Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Длина ИНН для %1 должна составлять %2 символов.'"),
			?(ЭтоЮрЛицо, "юридического лица", "ИП"),
			ТребуемаяДлина);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ИНН",,
			Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры