
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ЭтоВозврат = (Объект.ВидОперации =ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника"));
	ЭтоКлиент = Ложь;
	
	ТипСправочника = ?(ЭтоВозврат, "СправочникСсылка.Сотрудники", "СправочникСсылка.Контрагенты");
	Элементы.Плательщик.ОграничениеТипа = Новый ОписаниеТипов(ТипСправочника);
	
	Если НЕ ЭтоВозврат
		И ЗначениеЗаполнено(Объект.Плательщик)
		И ТипЗнч(Объект.Плательщик) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ТипКонтрагента = РаботаСРеквизитамиВызовСервера.ПолучитьРеквизитОбъекта(Объект.Плательщик, "ТипКонтрагента");
		ЭтоКлиент = (ТипКонтрагента =ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент"));
	КонецЕсли;
	
	ВидимостьДоговора = НЕ (ЭтоВозврат Или ЭтоКлиент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Договор", "Видимость", ВидимостьДоговора);
	
КонецПроцедуры
