
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	
	СформироватьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	СформироватьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	
	СформироватьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФИО()
	
	Если ЗначениеЗаполнено(Объект.Отчество) Тогда
		Объект.Наименование =
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 %2 %3'"),
		Объект.Фамилия,
		Объект.Имя,
		Объект.Отчество);
	Иначе
		Объект.Наименование =
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 %2'"),
		Объект.Фамилия,
		Объект.Имя);
	КонецЕсли;
	
КонецПроцедуры
