
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ЭтоВыдача = (
	Объект.ВидОперации =ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику")
	ИЛИ
	Объект.ВидОперации =ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты"));
	
	ЭтоКлиент = Ложь;
	
	ТипСправочника = ?(ЭтоВыдача, "СправочникСсылка.Сотрудники", "СправочникСсылка.Контрагенты");
	Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов(ТипСправочника);
	
	Если НЕ ЭтоВыдача
		И ЗначениеЗаполнено(Объект.Получатель)
		И ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ТипКонтрагента = РаботаСРеквизитамиВызовСервера.ПолучитьРеквизитОбъекта(Объект.Получатель, "ТипКонтрагента");
		ЭтоКлиент = (ТипКонтрагента =ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент"));
	КонецЕсли;
	
	ВидимостьДоговора = НЕ (ЭтоВыдача Или ЭтоКлиент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Договор", "Видимость", ВидимостьДоговора);
	
КонецПроцедуры
